[
    {
        "id": "ei0FTRRrlG",
        "content": {
            "title": "Final Decision",
            "decision": "Reject",
            "comment": "This paper is concerned with sequence segmentation. The authors introduce a framework which they call 'lexical unit analysis' - a neural network is used to score spans and then dynamic programming is used to find the best scoring overall segmentation. The authors present extensive experiments on various Chinese NLP tasks, obtaining better results than the systems they compare to.\n\nReviewers raised concerns, including about novelty. In my view, beyond beating the state of the baselines on the chosen tasks, it is hard to extract an actionable insight or novel conceptual understanding. Therefore, the paper is not recommended for acceptance in its current form."
        },
        "date": 1610040540137,
        "signatures": "ICLR 2021 Conference Program Chairs",
        "reply": []
    },
    {
        "id": "tgf4_wXqwUX",
        "content": {
            "title": "This paper presents a new sequential segmentation method by making all possible spans in a sentence as candidate segments and applies dynamic programming to find the best segmentation.  The method is tested with various sequential tagging problems and achieved state-of-the-art results for most of the problems.",
            "review": "The paper proposes a new algorithm for sentence segmentation which can be applied to various sequential tagging problems.\nThe motivation and the description of the algorithm are clearly given, and the proposed method achieved state-of-the-art results for most of the problems and datasets.\n\nThe proposed method tries to find all possible segments in the given input sequence, to estimate the scores of the segments using pre-trained BERT representations, and to find the best sequence of segments using the dynamic programming algorithms.  The proposed method is general enough to apply to various sequential tagging problems and natural language sentence analysis.\n\nWhile the proposed method looks new to apply to the sequential tagging problems in natural language processing, the dynamic programming approach to sequential analysis is a well-known method in the speech recognition community where a sequence of phonemes are segmented into a word sequence.  Also, a similar method has been applied to the segmentation of character sequences into word sequences for the languages that have no delimiters between words, such as Chinese and Japanese.   In these views, the novelty of the paper is not high.   On the contrary, the application of the BERT-based representation to the sequence segmentation tasks such as sentence segmentation and sequential labelling may be new, and the finding that this method can attain a state-of-the-art performance in those problems could be worth reporting.\n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        "date": 1603989085795,
        "signatures": "ICLR 2021 Conference Paper21 AnonReviewer4",
        "reply": [
            {
                "id": "leX94iNimVL",
                "content": {
                    "title": "Response to AnonReviewer4",
                    "comment": "Thanks for your valuable comments.\n\nComment-1: While the proposed method looks new to apply to the sequential tagging problems in natural language processing, the dynamic programming approach to sequential analysis is a well-known method in the speech recognition community where a sequence of phonemes are segmented into a word sequence. Also, a similar method has been applied to the segmentation of character sequences into word sequences for the languages that have no delimiters between words, such as Chinese and Japanese. \n\nAnswer-1: Would you please show us the related works in speech recognition? We will clarify the differences between them and our work. The proposed LUA has made significant contributions to NLP. Currently, the dominant approaches to text segmentation are sequence labeling and span-based models. However, they suffer from many problems, which have been made clear in Introduction (Section 1). LUA addresses all of them and, importantly, it has established new state-of-the-art performances in 13 datasets. LUA is very light-weight and highly effective. We strongly believe that LUA will be a new framework for text segmentation. We sincerely hope the reviewer can see the value of this work to NLP.\n\n\n\nComment-2: On the contrary, the application of the BERT-based representation to the sequence segmentation tasks such as sentence segmentation and sequential labelling may be new, and the finding that this method can attain a state-of-the-art performance in those problems could be worth reporting\n\nAnswer-2: In fact, most of the compared baselines adopt BERT as the sentence encoder, but our proposed LUA has still significantly outperformed them. This demonstrates that the superiority of LUA is not attributed to BERT but thanks to its attractive properties. As described in Introduction (Section 1), LUA avoids predicting invalid segmentation, overcomes the label bias issue, consistently uses DP in both training and evaluation, etc."
                },
                "date": 1605513506643,
                "signatures": "ICLR 2021 Conference Paper21 Authors",
                "reply": []
            }
        ]
    },
    {
        "id": "njhGY3IgR0o",
        "content": {
            "title": "Not a clear contribution",
            "review": "The paper is well-written, easy to follow and clear. However, the novelty and main contribution of the paper is not clear. The authors used a scoring model to score the composition of each segment, as well as the probability of having a specific label for the segment. The BERT language model is used in the paper to encode the input sequence. The training part is a more like a supervised training and a dynamic programming (DP) approach is used for inference. It is not clear how DP contributes to the success of the model, as the scores for segments are derived during the training (which seems most of the success is coming from the labeled data (i.e. supervised training) and BERT encoding). One other thing about formatting and citing references, some of the references are published in conference proceedings, not sure why authors cited their arxiv version.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        "date": 1603924500727,
        "signatures": "ICLR 2021 Conference Paper21 AnonReviewer1",
        "reply": [
            {
                "id": "N9wvWuBauz7",
                "content": {
                    "title": "Response to AnonReviewer1",
                    "comment": "Thanks for your valuable comments.\n\nComment-1: The training part is a more like a supervised training and a dynamic programming (DP) approach is used for inference.\n\nAnswer-1: Actually, DP is adopted for both training and inference in a consistent manner. For example, at training time, we use DP to compute f(\\hat{y}) for inducing the max-margin loss (see Eq. (8)). This consistency guarantees that LUA is capable of overcoming the label bias problem. \n\nComment-2: It is not clear how DP contributes to the success of the model, as the scores for segments are derived during the training (which seems most of the success is coming from the labeled data (i.e. supervised training) and BERT encoding).\n\nAnswer-2: There are three important facts: 1) the tasks in text segmentation are all supervised learning; 2) most of our baselines adopt BERT as the sequence encoder; 3) DP is consistently used in both training and inference. Therefore, the achieved promising performances are not attributed to labeled data or BERT but to its attractive properties. As made clear in Introduction (Section 1), our proposed LUA avoids predicting invalid segmentation, overcomes the label bias issue, consistently uses DP in both training and evaluation, etc.\n\nComment-3: One other thing about formatting and citing references, some of the references are published in conference proceedings, not sure why authors cited their arxiv version.\n\nAnswer-3: We will cite the conference/journal versions of these published papers.\n"
                },
                "date": 1605513722741,
                "signatures": "ICLR 2021 Conference Paper21 Authors",
                "reply": []
            }
        ]
    },
    {
        "id": "VaKf2MrmuOF",
        "content": {
            "title": "Segmenting Natural Language Sentences via Lexical Unit Analysis",
            "review": "This paper presents a method called LUA, Lexical Unit Analysis for general segmentation tasks. LUA scores all the valid segmentation of a sequence and uses Dynamic Programming to find the segmentation with the highest score. In addition, LUA can incorporate labeling of the segment as an additional component for span labeling tasks. \n\nPros:\n1. LUA overcomes the shortages of sequence labeling as a token-based tagging method and span-based models as well, by treating them separately.\n2. The decomposition of scoring label and scoring span allows the pre-computation of the maximum label score for each span, reducing the complexity.\n3. This method achieve the state of the art performance on 13 out of 15 data sets empirically.\n\nCons:\n1. The novelty is incremental, as the idea of calculating span-based score and label-based score with DP has been used widely in constituent parsing, which applies interval DP in a similar way. Also check semi-CRF model (Sunita Sarawagi and William W. Cohen, 2004).\n2. The way of using neural model to calculate the span-based scoring seems to be very arbitrary (Eq3), without any explanation why it is designed in this way.\n3. Label correlations are used to mimic correlation scoring, however the transition between spans are not explicitly modeled.\n\nQuestions:\n1. LUA is only used in inference stage. Do you think by using LUA in training as well, though slower, the performance can be further improved?\n2. Do you have any intuition of why designing the scoring function (Eq3) in that way?",
            "rating": "7: Good paper, accept",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        "date": 1603755211280,
        "signatures": "ICLR 2021 Conference Paper21 AnonReviewer3",
        "reply": [
            {
                "id": "MHuFjpSZiG",
                "content": {
                    "title": "Response to AnonReviewer3",
                    "comment": "Thanks for your valuable feedbacks.\n\nQuestion-1: LAU is only used in inference stage. Do you think by using LUA in training as well, though slower, the performance can be further improved?\n\nAnswer-1: DP is used for both training and inference in a consistent manner. As shown in Eq. (8), at training time, we use DP to calculate f(\\hat{y}) for inducing the max-margin loss. Besides, in our preliminary experiments, we find that not using DP in training severely degrades the performances. Although DP is involved in training, its running time is still competitive. As shown in Table 6, it is even faster than BERT+CRF by about 1 minute for one training epoch.\n\nQuestion-2: Do you have any intuition of why designing the scoring function (Eq3) in that way? \n\nAnswer-2: The design of Eq. (3) is inspired by the Eq. (14) in ESIM [Chen et al., Enhanced LSTM for Natural Language Inference, ACL 2017]. We will clarify this in the revised version. \n\nComment-3: The novelty is incremental, as the idea of calculating span-based score and label-based score with DP has been used widely in constituent parsing, which applies interval DP in a similar way. Also check semi-CRF model (Sunita Sarawagi and William W. Cohen, 2004).\n\nAnswer-3: Recent methods to text segmentation are dominated by sequence labeling and span-based models. However, they suffer from many problems that are described in Introduction (Section 1). Our proposed LUA solves all of them and have obtained new state-of-the-art results on 13 datasets. Span-based constituent parsers can’t capture the label correlations among constituents and semi-CRF is still an extension of CRF. LUA is highly light-weight and very effective. We strongly believe that LUA will have a great impact on future research.\n\nComment-4: Label correlations are used to mimic correlation scoring, however the transition between spans are not explicitly modeled.\n\nAnswer-4: This is an interesting direction and we will explore it in future work. "
                },
                "date": 1605513831684,
                "signatures": "ICLR 2021 Conference Paper21 Authors",
                "reply": []
            }
        ]
    }
]